package com.wjd.practice.leetcode.bit;

import com.wjd.practice.TestCase;

/**
 * 190. 颠倒二进制位
 * <p>
 * 颠倒给定的 32 位无符号整数的二进制位。
 * <p>
 * 提示：
 * <p>
 * 请注意，在某些语言（如 Java）中，没有无符号整数类型。
 * <p>
 * 在这种情况下，输入和输出都将被指定为有符号整数类型，并且不应影响您的实现，
 * <p>
 * 因为无论整数是有符号的还是无符号的，其内部的二进制表示形式都是相同的。
 * <p>
 * 在 Java 中，编译器使用二进制补码记法来表示有符号整数。
 * <p>
 * 因此，在 示例 2 中，输入表示有符号整数 -3，输出表示有符号整数 -1073741825。
 * <p>
 * 示例 1：
 * <p>
 * 输入：n = 00000010100101000001111010011100
 * 输出：964176192 (00111001011110000010100101000000)
 * 解释：输入的二进制串 00000010100101000001111010011100 表示无符号整数 43261596，
 * 因此返回 964176192，其二进制表示形式为 00111001011110000010100101000000。
 * <p>
 * 示例 2：
 * <p>
 * 输入：n = 11111111111111111111111111111101
 * 输出：3221225471 (10111111111111111111111111111111)
 * 解释：输入的二进制串 11111111111111111111111111111101 表示无符号整数 4294967293，
 * 因此返回 3221225471 其二进制表示形式为 10111111111111111111111111111111 。
 * <p>
 * 提示：
 * <p>
 * 输入是一个长度为 32 的二进制字符串
 * <p>
 * 进阶: 如果多次调用这个函数，你将如何优化你的算法？
 *
 * @author weijiaduo
 * @since 2022/7/9
 */
public class ReverseBits {

    /**
     * 思路：双指针法，交换2指针的bit值
     * <p>
     * 复杂度：时间 O(n/2) 空间O(1)
     * <p>
     * 执行耗时:0 ms,击败了100.00% 的Java用户
     * 内存消耗:40.9 MB,击败了40.29% 的Java用户
     */
    @TestCase(input = {"43261596"},
            output = {"964176192"})
    public int exchangeReverseBits(int n) {
        int high = Integer.SIZE - 1, low = 0;
        while (low < high) {
            int step = high - low;
            int newHigh = (n << step) & (1 << high);
            int newLow = (n >> step) & (1 << low);
            n = n & (~(1 << high)) | newHigh;
            n = n & (~(1 << low)) | newLow;
            high--;
            low++;
        }
        return n;
    }

    /**
     * 看了官解，觉得我真是傻~~
     * <p>
     * 官解：就单纯的倒过来设置
     * <p>
     * 复杂度：时间 O(n) 空间O(1)
     * <p>
     * 执行耗时:0 ms,击败了100.00% 的Java用户
     * 内存消耗:40.7 MB,击败了57.18% 的Java用户
     */
    @TestCase(input = {"43261596"},
            output = {"964176192"})
    public int newReverseBits(int n) {
        int rev = 0, m = Integer.SIZE;
        for (int i = 0; i < m && n != 0; i++) {
            rev |= (n & 1) << (m - 1 - i);
            n >>>= 1;
        }
        return rev;
    }

    /**
     * 官解：分治法，递归交换左右2部分，最底层是奇数位和偶数位进行交换
     * <p>
     * 复杂度：时间 O(logn) 空间 O(1)
     * <p>
     * 执行耗时:0 ms,击败了100.00% 的Java用户
     * 内存消耗:40.8 MB,击败了55.02% 的Java用户
     */
    @TestCase(input = {"43261596"},
            output = {"964176192"})
    public int divideReverseBits(int n) {
        // 01010101010101010101010101010101
        final int m1 = 0x55555555;
        // 00110011001100110011001100110011
        final int m2 = 0x33333333;
        // 00001111000011110000111100001111
        final int m4 = 0x0f0f0f0f;
        // 00000000111111110000000011111111
        final int m8 = 0x00ff00ff;

        n = (n >>> 1) & m1 | (n & m1) << 1;
        n = (n >>> 2) & m2 | (n & m2) << 2;
        n = (n >>> 4) & m4 | (n & m4) << 4;
        n = (n >>> 8) & m8 | (n & m8) << 8;
        return n >>> 16 | n << 16;
    }

}
